emacs-blog/www/debian-wheezy-xfce-touchpad.org
#+SETUPFILE: css/level-0.orgcss
#+TITLE: Xfce 触摸板启用“点击”(Debian Wheezy)

* 问题描述

  系统：Debian Wheezy Xfce。

  问题：虽然安装了 Xorg 触摸板输入的驱动(synaptics)，但是“点击”触摸板中间部分，仍然无法启用其相当于鼠标的“单击”功能。
* 解决方法

  1.首先，保证安装了 synaptics 驱动：

  #+BEGIN_SRC shell
  $ sudo apt-get install xserver-xorg-input-synaptics
  #+END_SRC

  2.复制 =/usr/share/X11/xorg.conf.d= 到 =/etc/X11=

  #+BEGIN_SRC shell
  $ sudo cp -R /usr/share/X11/xorg.conf.d/ /etc/X11
  #+END_SRC

  3.将原 =/etc/X11/xorg.conf.d/10-evdev.conf= 配置文件下面同一部分内容改为：

  #+BEGIN_EXAMPLE
    Section "InputClass"  
            Identifier "evdev touchpad catchall"  
            MatchIsTouchpad "on"  
            MatchDevicePath "/dev/input/event*"  
            Driver "synaptics"  
            Option "TapButton1" "1"  
            Option "TapButton2" "2"  
            Option "TapButton2" "3"  
    EndSection
  #+END_EXAMPLE

  关于上面文件中 =TapButton=  的使用，man 手册里面的解释为

  #+BEGIN_EXAMPLE
Option "TapButton1" "integer"
    Which mouse button is reported on a non-corner one-finger tap.  Set  to
    0 to disable. Property: "Synaptics Tap Action"
 
Option "TapButton2" "integer"
    Which  mouse button is reported on a non-corner two-finger tap.  Set to
    0 to disable. Property: "Synaptics Tap Action"

Option "TapButton3" "integer"
    Which mouse button is reported on a non-corner three-finger  tap.   Set
    to 0 to disable. Property: "Synaptics Tap Action"
   #+END_EXAMPLE

  4.重启系统

* 关于 synaptics

  synaptics 是触摸板的 Xorg 输入驱动。即使触摸板也可以由 evdev 或鼠标驱动处理，但该驱动能够允许触摸板实现更多的功能。synaptics 这个名称属历史沿袭，在 Linux 下，特定硬件有内核处理，但该驱动适用于任何触摸板。如果设备为“PS/2 Mouse”或更古老，内核驱动可能不会支持这样的设备，该驱动也会提供有限支持的功能。不过，适用于任何设备，不管功能多少，都是非常不错了。

  *synaptics 部分功能列表* ：

  + 非线性加速触摸运动
  + 通过短暂触摸，实现单击/双击事件
  + 多指触摸：需要硬件支持

  关于 =synaptics= 的更多内容，可以在终端运行 =man synaptics= 进行查看。
