emacs-blog/public_html/debian-wheezy-xfce-touchpad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Xfce 触摸板启用“点击”(Debian Wheezy)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Xfce 触摸板启用“点击”(Debian Wheezy)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19T21:13+0800"/>
<meta name="author" content="tuhaihe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="css/org.css" rel="stylesheet" type="text/css">
<link href="css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Xfce 触摸板启用“点击”(Debian Wheezy)</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">问题描述</h2>
<div class="outline-text-2" id="text-1">


<p>
  系统：Debian Wheezy Xfce。
</p>
<p>
  问题：虽然安装了 Xorg 触摸板输入的驱动(synaptics)，但是“点击”触摸板中间部分，仍然无法启用其相当于鼠标的“单击”功能。
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">解决方法</h2>
<div class="outline-text-2" id="text-2">


<p>
  1.首先，保证安装了 synaptics 驱动：
</p>



<pre class="example">$ sudo apt-get install xserver-xorg-input-synaptics
</pre>


<p>
  2.复制 <code>/usr/share/X11/xorg.conf.d</code> 到 <code>/etc/X11</code>
</p>



<pre class="example">$ sudo cp -R /usr/share/X11/xorg.conf.d/ /etc/X11
</pre>


<p>
  3.将原 <code>/etc/X11/xorg.conf.d/10-evdev.conf</code> 配置文件下面同一部分内容改为：
</p>



<pre class="example">Section "InputClass"  
        Identifier "evdev touchpad catchall"  
        MatchIsTouchpad "on"  
        MatchDevicePath "/dev/input/event*"  
        Driver "synaptics"  
        Option "TapButton1" "1"  
        Option "TapButton2" "2"  
        Option "TapButton2" "3"  
EndSection
</pre>


<p>
  关于上面文件中 <code>TapButton</code>  的使用，man 手册里面的解释为
</p>



<pre class="example">Option "TapButton1" "integer"
    Which mouse button is reported on a non-corner one-finger tap.  Set  to
    0 to disable. Property: "Synaptics Tap Action"
 
Option "TapButton2" "integer"
    Which  mouse button is reported on a non-corner two-finger tap.  Set to
    0 to disable. Property: "Synaptics Tap Action"

Option "TapButton3" "integer"
    Which mouse button is reported on a non-corner three-finger  tap.   Set
    to 0 to disable. Property: "Synaptics Tap Action"
</pre>


<p>
  4.重启系统
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">关于 synaptics</h2>
<div class="outline-text-2" id="text-3">


<p>
  synaptics 是触摸板的 Xorg 输入驱动。即使触摸板也可以由 evdev 或鼠标驱动处理，但该驱动能够允许触摸板实现更多的功能。synaptics 这个名称属历史沿袭，在 Linux 下，特定硬件有内核处理，但该驱动适用于任何触摸板。如果设备为“PS/2 Mouse”或更古老，内核驱动可能不会支持这样的设备，该驱动也会提供有限支持的功能。不过，适用于任何设备，不管功能多少，都是非常不错了。
</p>
<p>
  <b>synaptics 部分功能列表</b> ：
</p>
<ul>
<li>非线性加速触摸运动
</li>
<li>通过短暂触摸，实现单击/双击事件
</li>
<li>多指触摸：需要硬件支持
</li>
</ul>


<p>
  关于 <code>synaptics</code> 的更多内容，可以在终端运行 <code>man synaptics</code> 进行查看。
</p></div>
</div>
</div>

<div id="postamble">
<p class="postamble">Update time: 2013-05-19T21:13+0800.</p> 
</div>
</body>
</html>
